doc: Updated the documentations and the image reference
